pages/Lesson_1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Text</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Text</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a>
<ul>
<li><a href="#sec-1-1">Build  It</a></li>
<li><a href="#sec-1-2">Badge It</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class=ribbon>
<a href="https://github.com/stsb11/9-CS-euler">Fork me on GitHub</a>
</div>

<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>You've written a fair amount of code over the last three years.
</li>
<li>In this project, you'll try writing code for yourself.
</li>
</ul>
</div>
<div id="outline-container-sec-1-1" class="outline-3 build">
<h3 id="sec-1-1">Build  It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>In your first task, you'll work a little bit with variables and <code>If</code> statements. 
</li>
<li>Run the program below a few times by clicking the <code>Play</code> icon.
<ul class="org-ul">
<li>Can you make the program show each different branch of the conversation?
</li>
<li>Why do you think the program always finishes with 'Nice talking with you'?
</li>
<li>Why don't you always get prompted for your feelings about kittens?
</li>
</ul>
</li>
<li>Try this task
</li>
</ul>
<iframe src="https://trinket.io/embed/python/9526781145" width="100%" height="600" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 badge">
<h3 id="sec-1-2">Badge It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><b>Silver:</b> Open this <a href="https://scratch.mit.edu/projects/112644879/#editor">template</a> in a new tab, and finish writing the program above in Scratch. Upload a screenshot of your finished code. 
</li>
<li><b>Gold:</b> Modify the Python program above to remember someone's hot drink order.
<ul class="org-ul">
<li>First should be asked if they prefer tea or coffee.
</li>
<li>Ask if they take milk with their tea/coffee.
</li>
<li>Next, they should be asked if they want sugar.
<ul class="org-ul">
<li>If they do, ask how many sugars they'd like.
</li>
</ul>
</li>
<li>The order should be showed to the user.
</li>
<li>e.g. 'You drink tea with milk and no sugar.'
</li>
</ul>
</li>
<li><b>Platinum:</b> Make the program more grammatically correct, so it'll say either '1 sugar' or '2/3/4/n sugars'.
</li>
<li><span class="underline">or</span>
</li>
<li>Make the Python program say <i>that's a lot of sugar</i> if the user says they want more than 3 sugars. 
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
